In [1]:
import pandas as pd

In [2]:
order_id = [1, 1, 1, 2, 2, 3, 4]
location = ['Melbourne', 'Melbourne', 'Melbourne', 'Sydney', 'Sydney', 'Perth', 'Byron Bay']
product_id = [1, 2, 5, 5, 1, 2, 6]
item_price = [12, 21, 5, 5, 12, 21, 14]
qty = [19, 72, 16, 45, 1, 13, 18]
year = [2016, 2016, 2016, 2017, 2017, 2016, 2017]

In [3]:
orders_dicts = {
    'order_id': order_id,
    'location': location,
    'product_id': product_id,
    'item_price': item_price,
    'qty': qty,
    'year': year
}

In [4]:
df = pd.DataFrame(orders_dicts)

In [5]:
df.head(20)

   order_id   location  product_id  item_price  qty  year
0         1  Melbourne           1          12   19  2016
1         1  Melbourne           2          21   72  2016
2         1  Melbourne           5           5   16  2016
3         2     Sydney           5           5   45  2017
4         2     Sydney           1          12    1  2017
5         3      Perth           2          21   13  2016
6         4  Byron Bay           6          14   18  2017

In [12]:
df.groupby('order_id').sum(numeric_only=True)

          product_id  item_price  qty  year
order_id
1                  8          38  107  6048
2                  6          17   46  4034
3                  2          21   13  2016
4                  6          14   18  2017

In [13]:
def create_foo(data):
    print(type(data))

In [14]:
df.groupby('order_id').apply(create_foo)

<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.frame.DataFrame'>

Empty DataFrame
Columns: []
Index: []

In [15]:
df2 = df[['order_id', 'item_price']]

In [16]:
df2.head()

   order_id  item_price
0         1          12
1         1          21
2         1           5
3         2           5
4         2          12

In [17]:
def my_sum(data):
    return data['item_price'].sum()

In [18]:
df2.groupby('order_id').apply(my_sum)

order_id
1    38
2    17
3    21
4    14
dtype: int64

In [19]:
def my_function(col):
    print(type(col))
    print(col)
    
df2[['order_id','item_price']].apply(my_function)

<class 'pandas.core.series.Series'>
0    1
1    1
2    1
3    2
4    2
5    3
6    4
Name: order_id, dtype: int64
<class 'pandas.core.series.Series'>
0    12
1    21
2     5
3     5
4    12
5    21
6    14
Name: item_price, dtype: int64

order_id      None
item_price    None
dtype: object

In [20]:
my_dict = {}

def my_function2(x):
    print('called')
    my_dict[x.order_id.unique()[0]] = x.item_price.values
    
df2.groupby('order_id').apply(my_function2)

called
called
called
called

Empty DataFrame
Columns: []
Index: []

In [21]:
my_dict

{1: array([12, 21,  5]), 2: array([ 5, 12]), 3: array([21]), 4: array([14])}

In [22]:
my_dict[1]

array([12, 21,  5])